app/views/posts/index.html.erb

       <div>
        <%post.most_recent_comment.includes(:author).each do |comment|%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."posts_id" = $1  [["posts_id", 1]]