app/views/posts/show.html.erb

   <div>
      <% @post.most_recent_comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."posts_id" = $1  [["posts_id", 1]]