app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <div class="post-comment-likes">
        <%comments = Comment.where(post_id: @post.id)%>
        <%comments.each do |comment|%>
            <span><%user = User.find_by(id: comment.author_id).name%></span>