app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "comments_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["comments_counter", 2], ["updated_at", "2023-02-22 15:33:34.457494"], ["id", 4]]
INSERT INTO "comments" ("author_id", "post_id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_id", 1], ["post_id", 4], ["text", "Welcome to our app."], ["created_at", "2023-02-22 15:33:34.442225"], ["updated_at", "2023-02-22 15:33:34.442225"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.author = current_user
    @comment.post = Post.find(params[:post_id])
    return unless @comment.save