app/controllers/likes_controller.rb

  def create
    user = current_user
    @like = Like.new(
      post_id: params[:post_id],
      author_id: user.id
    )
    return unless @like.save
---
INSERT INTO "likes" ("author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author_id", 1], ["post_id", 3], ["created_at", "2023-02-22 15:26:31.281374"], ["updated_at", "2023-02-22 15:26:31.281374"]]