app/controllers/posts_controller.rb

  def create_comment
    @comment = Comment.new(comment_prarams)
    @comment.author = current_user
    @comment.post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = $1  [["author_id", 1]]