app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    # @posts = User.find(params[:id])
    @user = User.find(params[:id])
    @posts = Post.find(params[:id])