app/models/comment.rb

  def update_comments_counter
    post.update(comments_counter: post.comments.all.length)
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]
UPDATE "posts" SET "comments_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["comments_counter", 2], ["updated_at", "2023-02-22 15:33:34.457494"], ["id", 4]]