app/models/like.rb

  def update_likes_counter
    post.update(likes_counter: post.likes.all.length)
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 3]]
UPDATE "posts" SET "likes_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["likes_counter", 1], ["updated_at", "2023-02-22 15:26:31.295933"], ["id", 3]]