app/models/post.rb

    def update_posts_counter
        author.update(posts_counter: author.posts.all.length)
---
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = $1  [["author_id", 1]]